zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XS_PCS_MMD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XS_PCS_MMD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XS_PCS_MMD_H_)  /* Check if memory map has not been already included */
#define S32K566_XS_PCS_MMD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XS_PCS_MMD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XS_PCS_MMD_Peripheral_Access_Layer XS_PCS_MMD Peripheral Access Layer
 * @{
 */

/** XS_PCS_MMD - Register Layout Typedef */
typedef struct XS_PCS_MMD_Struct {
  __IO uint16_t SR_XS_PCS_CTRL1;                   /**< SR XS or PCS MMD Control1 Register, offset: 0x0 */
  __I  uint16_t SR_XS_PCS_STS1;                    /**< SR XS or PCS MMD Status1 Register, offset: 0x2 */
  __I  uint16_t SR_XS_PCS_DEV_ID1;                 /**< SR XS or PCS MMD Device Identifier 1 Register, offset: 0x4 */
  __I  uint16_t SR_XS_PCS_DEV_ID2;                 /**< SR XS or PCS MMD Device Identifier 2 Register, offset: 0x6 */
  __I  uint16_t SR_XS_PCS_SPD_ABL;                 /**< SR XS or PCS MMD Speed Ability Register, offset: 0x8 */
  __I  uint16_t SR_XS_PCS_DEV_PKG1;                /**< SR XS or PCS MMD Devices in Package 1 Register, offset: 0xA */
  __I  uint16_t SR_XS_PCS_DEV_PKG2;                /**< SR XS or PCS MMD Devices in Package 2 Register, offset: 0xC */
  __IO uint16_t SR_XS_PCS_CTRL2;                   /**< SR PCS Control2 Register This register is applicable only for the PCS MMD., offset: 0xE */
  __I  uint16_t SR_XS_PCS_STS2;                    /**< SR XS or PCS MMD Status2 Register, offset: 0x10 */
  __I  uint16_t SR_XS_PCS_STS3;                    /**< SR PCS MMD Status3 Register This register is applicable only for the PCS MMD, offset: 0x12 */
  uint8_t RESERVED_0[8];
  __I  uint16_t SR_XS_PCS_PKG1;                    /**< SR XS or PCS MMD Package Identifier 1 Register, offset: 0x1C */
  __I  uint16_t SR_XS_PCS_PKG2;                    /**< SR XS or PCS MMD Package Identifier 2 Register, offset: 0x1E */
  uint8_t RESERVED_1[8];
  __I  uint16_t SR_XS_PCS_EEE_ABL;                 /**< SR XS or PCS MMD EEE Capability Register, offset: 0x28 */
  __I  uint16_t SR_XS_PCS_EEE_ABL2;                /**< SR PCS MMD EEE Control and Capability2 Register, offset: 0x2A */
  __I  uint16_t SR_XS_PCS_EEE_WKERR;               /**< SR XS or PCS MMD EEE Wake Error Counter Register This register is present only when EEE_EN = Enabled., offset: 0x2C */
  uint8_t RESERVED_2[2];
  __I  uint16_t SR_XS_PCS_LSTS;                    /**< SR XS or PCS MMD 10GBASE-X Lane Status Register This register is applicable only for the XS and PCS MMDs when the DWC_xpcs is not configured in the following modes: - 10GBASE-R PCS - KR_Only, offset: 0x30 */
  __IO uint16_t SR_XS_PCS_TCTRL;                   /**< SR XS or PCS MMD 10GBASE-X Test Control Register This register is present only with the XS and PCS MMDs when DWC_xpcs is not configured in the following modes: - 10GBASE-R PCS - KR_Only, offset: 0x32 */
  uint8_t RESERVED_3[3548];
  __I  uint16_t SR_PCS_TIME_SYNC_PCS_ABL;          /**< SR PCS MMD Time Sync Capability Register, offset: 0xE10 */
  __I  uint16_t SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR;   /**< SR PCS MMD Time Sync Tx Max Delay Lower Register, offset: 0xE12 */
  __I  uint16_t SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR;   /**< SR PCS MMD Time Sync Tx Max Delay Upper Register, offset: 0xE14 */
  __I  uint16_t SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR;   /**< SR PCS MMD Time Sync Tx Min Delay Lower Register, offset: 0xE16 */
  __I  uint16_t SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR;   /**< SR PCS MMD Time Sync Tx Min Delay Upper Register, offset: 0xE18 */
  __I  uint16_t SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR;   /**< SR PCS MMD Time Sync Rx Max Delay Lower Register, offset: 0xE1A */
  __I  uint16_t SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR;   /**< SR PCS MMD Time Sync Rx Max Delay Upper Register, offset: 0xE1C */
  __I  uint16_t SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR;   /**< SR PCS MMD Time Sync Rx Min Delay Lower Register, offset: 0xE1E */
  __I  uint16_t SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR;   /**< SR PCS MMD Time Sync Rx Min Delay Upper Register, offset: 0xE20 */
  uint8_t RESERVED_4[61918];
  __IO uint16_t VR_XS_PCS_DIG_CTRL1;               /**< VR XS or PCS MMD Digital Control1 Register, offset: 0x10000 */
  __IO uint16_t VR_XS_PCS_DIG_CTRL2;               /**< VR XS or PCS MMD Digital Control2 Register, offset: 0x10002 */
  __IO uint16_t VR_XS_PCS_DIG_ERRCNT_SEL;          /**< VR XS or PCS MMD Digital Error Count Select Register., offset: 0x10004 */
  uint8_t RESERVED_5[2];
  __I  uint16_t VR_XS_PCS_XAUI_CTRL;               /**< VR XS or PCS MMD XAUI Mode Control Register This register is present only when the DWC_xpcs is configured for RXAUI., offset: 0x10008 */
  __IO uint16_t VR_XS_PCS_DEBUG_CTRL;              /**< VR XS or PCS MMD Debug Control Register, offset: 0x1000A */
  __IO uint16_t VR_XS_PCS_EEE_MCTRL0;              /**< VR XS or PCS MMD EEE Mode Control Register This register enables or disables the Energy Efficient Ethernet (EEE) support., offset: 0x1000C */
  uint8_t RESERVED_6[2];
  __IO uint16_t VR_XS_PCS_EEE_TXTIMER;             /**< VR XS or PCS MMD EEE Tx Timer Register This register is present only if EEE_EN = Enabled., offset: 0x10010 */
  __IO uint16_t VR_XS_PCS_EEE_RXTIMER;             /**< VR XS or PCS MMD EEE Rx Timer Register This register is present only if EEE_EN = Enabled., offset: 0x10012 */
  uint8_t RESERVED_7[2];
  __IO uint16_t VR_XS_PCS_EEE_MCTRL1;              /**< VR XS or PCS MMD EEE Mode Control 1 Register This register also controls the Energy Efficient Ethernet (EEE) related settings of DWC_xpcs ., offset: 0x10016 */
  uint8_t RESERVED_8[8];
  __I  uint16_t VR_XS_PCS_DIG_STS;                 /**< VR XS or PCS MMD Digital Status Register, offset: 0x10020 */
  __I  uint16_t VR_XS_PCS_ICG_ERRCNT1;             /**< VR XS or PCS MMD Invalid Code Group Error Count1 Register The seven error counters EC0-EC6 do not overflow., offset: 0x10022 */
  uint8_t RESERVED_9[12];
  __I  uint16_t VR_XS_PCS_CDT_STS;                 /**< VR XS or PCS MMD Comma-Detect Status Register, offset: 0x10030 */
  __I  uint16_t VR_XS_PCS_MISC_STS;                /**< VR XS or PCS MMD Miscellaneous Status Register, offset: 0x10032 */
} XS_PCS_MMD_Type, *XS_PCS_MMD_MemMapPtr;

/** Number of instances of the XS_PCS_MMD module. */
#define XS_PCS_MMD_INSTANCE_COUNT                (1u)

/* XS_PCS_MMD - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD_BASE (0x860000u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD ((XS_PCS_MMD_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD_BASE)
/** Array initializer of XS_PCS_MMD peripheral base addresses */
#define IP_XS_PCS_MMD_BASE_ADDRS                 { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD_BASE }
/** Array initializer of XS_PCS_MMD peripheral base pointers */
#define IP_XS_PCS_MMD_BASE_PTRS                  { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PCS_MMD }

/* ----------------------------------------------------------------------------
   -- XS_PCS_MMD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XS_PCS_MMD_Register_Masks XS_PCS_MMD Register Masks
 * @{
 */

/*! @name SR_XS_PCS_CTRL1 - SR XS or PCS MMD Control1 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2_MASK   (0x3CU)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2_SHIFT  (2U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2_WIDTH  (4U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2(x)     (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_SS_5_2_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6_MASK      (0x40U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6_SHIFT     (6U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_SS6_MASK)

