zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP_MASK (0x200U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP_SHIFT (9U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_XAUI_STOP_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN_MASK    (0x400U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN_SHIFT   (10U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_CS_EN_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM_MASK      (0x800U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM_SHIFT     (11U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_LPM_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13_MASK     (0x2000U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13_SHIFT    (13U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13_WIDTH    (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13(x)       (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_SS13_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE_MASK      (0x4000U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE_SHIFT     (14U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_LBE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_CTRL1_RST_MASK      (0x8000U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_RST_SHIFT     (15U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_RST_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL1_RST(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL1_RST_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL1_RST_MASK)
/*! @} */

/*! @name SR_XS_PCS_STS1 - SR XS or PCS MMD Status1 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_STS1_LPMS_MASK      (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_LPMS_SHIFT     (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_LPMS_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_LPMS(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_LPMS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_LPMS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_RLU_MASK       (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RLU_SHIFT      (2U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RLU_WIDTH      (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RLU(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_RLU_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_RLU_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_CSC_MASK       (0x40U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_CSC_SHIFT      (6U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_CSC_WIDTH      (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_CSC(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_CSC_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_CSC_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_FLT_MASK       (0x80U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_FLT_SHIFT      (7U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_FLT_WIDTH      (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_FLT(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_FLT_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_FLT_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII_MASK    (0x100U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII_SHIFT   (8U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_RXLPII_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII_MASK    (0x200U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII_SHIFT   (9U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_TXLPII_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR_MASK    (0x400U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR_SHIFT   (10U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_RXLPIR_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR_MASK    (0x800U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR_SHIFT   (11U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS1_TXLPIR_MASK)
/*! @} */

/*! @name SR_XS_PCS_DEV_ID1 - SR XS or PCS MMD Device Identifier 1 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18_WIDTH (16U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_ID1_PCS_DEV_OUI_3_18_MASK)
/*! @} */

/*! @name SR_XS_PCS_DEV_ID2 - SR XS or PCS MMD Device Identifier 2 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0_MASK (0xFU)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0_WIDTH (4U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_RN_3_0_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0_MASK (0x3F0U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0_SHIFT (4U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0_WIDTH (6U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_MMN_5_0_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24_MASK (0xFC00U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24_SHIFT (10U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24_WIDTH (6U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_ID2_PCS_DEV_OUI_19_24_MASK)
/*! @} */

/*! @name SR_XS_PCS_SPD_ABL - SR XS or PCS MMD Speed Ability Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC_MASK    (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC_SHIFT   (0U)
#define XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_SPD_ABL_XGC_MASK)
/*! @} */

/*! @name SR_XS_PCS_DEV_PKG1 - SR XS or PCS MMD Devices in Package 1 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22_MASK (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_CLS22_MASK)

