zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD_MASK (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD_SHIFT (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PMA_PMD_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS_MASK   (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS_SHIFT  (2U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS_WIDTH  (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS(x)     (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_WIS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS_MASK   (0x8U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS_SHIFT  (3U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS_WIDTH  (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS(x)     (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PCS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS_MASK (0x10U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS_SHIFT (4U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_PHYXS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS_MASK (0x20U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS_SHIFT (5U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_DTEXS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC_MASK    (0x40U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC_SHIFT   (6U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_TC_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN_MASK    (0x80U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN_SHIFT   (7U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG1_AN_MASK)
/*! @} */

/*! @name SR_XS_PCS_DEV_PKG2 - SR XS or PCS MMD Devices in Package 2 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1_MASK  (0x4000U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1_SHIFT (14U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD1_MASK)

#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2_MASK  (0x8000U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2_SHIFT (15U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_DEV_PKG2_VSD2_MASK)
/*! @} */

/*! @name SR_XS_PCS_CTRL2 - SR PCS Control2 Register This register is applicable only for the PCS MMD. */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL_MASK (0xFU)
#define XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL_WIDTH (4U)
#define XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_CTRL2_PCS_TYPE_SEL_MASK)
/*! @} */

/*! @name SR_XS_PCS_STS2 - SR XS or PCS MMD Status2 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN_MASK    (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN_SHIFT   (0U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN_WIDTH   (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN(x)      (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_CAP_EN_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC_MASK (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC_SHIFT (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10_1GC_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW_MASK (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW_SHIFT (2U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBW_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT_MASK (0x8U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT_SHIFT (3U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_CAP_10GBT_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_RF_MASK        (0x400U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_RF_SHIFT       (10U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_RF_WIDTH       (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_RF(x)          (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_RF_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_RF_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_TF_MASK        (0x800U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_TF_SHIFT       (11U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_TF_WIDTH       (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_TF(x)          (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_TF_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_TF_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS2_DS_MASK        (0xC000U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_DS_SHIFT       (14U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_DS_WIDTH       (2U)
#define XS_PCS_MMD_SR_XS_PCS_STS2_DS(x)          (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS2_DS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS2_DS_MASK)
/*! @} */

