zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
/*! @name SR_XS_PCS_STS3 - SR PCS MMD Status3 Register This register is applicable only for the PCS MMD */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR_MASK (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS3_CAP_200GR_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR_MASK (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR_SHIFT (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS3_CAP_400GR_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX_MASK (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX_SHIFT (2U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS3_CAP_2PT5GX_MASK)

#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR_MASK   (0x8U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR_SHIFT  (3U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR_WIDTH  (1U)
#define XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR(x)     (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_STS3_CAP_5GR_MASK)
/*! @} */

/*! @name SR_XS_PCS_PKG1 - SR XS or PCS MMD Package Identifier 1 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18_WIDTH (16U)
#define XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_PKG1_PCS_PKG_OUI_3_18_MASK)
/*! @} */

/*! @name SR_XS_PCS_PKG2 - SR XS or PCS MMD Package Identifier 2 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0_MASK (0xFU)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0_WIDTH (4U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_RN_3_0_MASK)

#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0_MASK (0x3F0U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0_SHIFT (4U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0_WIDTH (6U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_MMN_5_0_MASK)

#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24_MASK (0xFC00U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24_SHIFT (10U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24_WIDTH (6U)
#define XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_PKG2_PCS_PKG_OUI_19_24_MASK)
/*! @} */

/*! @name SR_XS_PCS_EEE_ABL - SR XS or PCS MMD EEE Capability Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS_MASK     (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS_SHIFT    (0U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS_WIDTH    (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS(x)       (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_XS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE_MASK (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE_SHIFT (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_100TEE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE_MASK (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE_SHIFT (2U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_EN_1GTEEE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE_MASK   (0x8U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE_SHIFT  (3U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE_WIDTH  (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE(x)     (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_TEEE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE_MASK  (0x10U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE_SHIFT (4U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KXEEE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE_MASK (0x20U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE_SHIFT (5U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KX4EEE_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE_MASK  (0x40U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE_SHIFT (6U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL_KREEE_MASK)
/*! @} */

/*! @name SR_XS_PCS_EEE_ABL2 - SR PCS MMD EEE Control and Capability2 Register */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT_MASK (0x1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GT_MASK)

