zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT_MASK (0x2U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT_SHIFT (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GT_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT_MASK (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT_SHIFT (2U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_25GT_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX_MASK (0x80U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX_SHIFT (7U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_2PT5GKX_MASK)

#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR_MASK (0x100U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR_SHIFT (8U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR_WIDTH (1U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_ABL2_EEE_5GKR_MASK)
/*! @} */

/*! @name SR_XS_PCS_EEE_WKERR - SR XS or PCS MMD EEE Wake Error Counter Register This register is present only when EEE_EN = Enabled. */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC_SHIFT (0U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC_WIDTH (16U)
#define XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_EEE_WKERR_EEE_WEC_MASK)
/*! @} */

/*! @name SR_XS_PCS_LSTS - SR XS or PCS MMD 10GBASE-X Lane Status Register This register is applicable only for the XS and PCS MMDs when the DWC_xpcs is not configured in the following modes: - 10GBASE-R PCS - KR_Only */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_LSTS_LNS_MASK       (0xFU)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LNS_SHIFT      (0U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LNS_WIDTH      (4U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LNS(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_LSTS_LNS_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_LSTS_LNS_MASK)

#define XS_PCS_MMD_SR_XS_PCS_LSTS_LBA_MASK       (0x400U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LBA_SHIFT      (10U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LBA_WIDTH      (1U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LBA(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_LSTS_LBA_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_LSTS_LBA_MASK)

#define XS_PCS_MMD_SR_XS_PCS_LSTS_TPA_MASK       (0x800U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_TPA_SHIFT      (11U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_TPA_WIDTH      (1U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_TPA(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_LSTS_TPA_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_LSTS_TPA_MASK)

#define XS_PCS_MMD_SR_XS_PCS_LSTS_LA_MASK        (0x1000U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LA_SHIFT       (12U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LA_WIDTH       (1U)
#define XS_PCS_MMD_SR_XS_PCS_LSTS_LA(x)          (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_LSTS_LA_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_LSTS_LA_MASK)
/*! @} */

/*! @name SR_XS_PCS_TCTRL - SR XS or PCS MMD 10GBASE-X Test Control Register This register is present only with the XS and PCS MMDs when DWC_xpcs is not configured in the following modes: - 10GBASE-R PCS - KR_Only */
/*! @{ */

#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TP_MASK       (0x3U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TP_SHIFT      (0U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TP_WIDTH      (2U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TP(x)         (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_TCTRL_TP_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_TCTRL_TP_MASK)

#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE_MASK      (0x4U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE_SHIFT     (2U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE_WIDTH     (1U)
#define XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE(x)        (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE_SHIFT)) & XS_PCS_MMD_SR_XS_PCS_TCTRL_TPE_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_PCS_ABL - SR PCS MMD Time Sync Capability Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL_MASK (0x1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_RX_DLY_ABL_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL_MASK (0x2U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL_SHIFT (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TX_DLY_ABL_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY_MASK (0x4U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY_SHIFT (2U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_RX_DLY_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY_MASK (0x8U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY_SHIFT (3U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_FINE_TX_DLY_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC_MASK (0x400U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC_SHIFT (10U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_NUC_MASK)

