zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS_MASK (0x800U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS_SHIFT (11U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_MLS_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS_MASK (0x1000U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS_SHIFT (12U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_FS_MASK)

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD_MASK (0x2000U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD_SHIFT (13U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD_WIDTH (1U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_PCS_ABL_TREF_SFD_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR - SR PCS MMD Time Sync Tx Max Delay Lower Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_LWR_PCS_TX_MAX_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR - SR PCS MMD Time Sync Tx Max Delay Upper Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MAX_DLY_UPR_PCS_TX_MAX_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR - SR PCS MMD Time Sync Tx Min Delay Lower Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_LWR_PCS_TX_MIN_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR - SR PCS MMD Time Sync Tx Min Delay Upper Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_TX_MIN_DLY_UPR_PCS_TX_MIN_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR - SR PCS MMD Time Sync Rx Max Delay Lower Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_LWR_PCS_RX_MAX_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR - SR PCS MMD Time Sync Rx Max Delay Upper Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MAX_DLY_UPR_PCS_RX_MAX_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR - SR PCS MMD Time Sync Rx Min Delay Lower Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_LWR_PCS_RX_MIN_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR - SR PCS MMD Time Sync Rx Min Delay Upper Register */
/*! @{ */

#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR_MASK (0xFFFFU)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR_SHIFT (0U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR_WIDTH (16U)
#define XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR_SHIFT)) & XS_PCS_MMD_SR_PCS_TIME_SYNC_RX_MIN_DLY_UPR_PCS_RX_MIN_DLY_UPR_MASK)
/*! @} */

/*! @name VR_XS_PCS_DIG_CTRL1 - VR XS or PCS MMD Digital Control1 Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DSKBYP_MASK)

