zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP_MASK (0x2U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_BYP_PWRUP_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE_MASK (0x4U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE_SHIFT (2U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_2_5G_MODE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0_MASK (0x10U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1_MASK (0xE0U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_DTXLANED_3_1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT_MASK (0x100U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT(x)   (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_INIT_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN_MASK (0x200U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN_SHIFT (9U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USXG_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST_MASK (0x400U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST_SHIFT (10U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_USRA_RST_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV_MASK (0x800U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV_SHIFT (11U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_PWRSV_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP_MASK (0x1000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP_SHIFT (12U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_CL37_BP_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1_MASK (0x2000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1_SHIFT (13U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_EN_VSMMD1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE_MASK (0x4000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE_SHIFT (14U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_R2TLBE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST_MASK (0x8000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST_SHIFT (15U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL1_VR_RST_MASK)
/*! @} */

/*! @name VR_XS_PCS_DIG_CTRL2 - VR XS or PCS MMD Digital Control2 Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1_MASK (0xEU)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_RX_POL_INV_3_1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0_MASK (0x10U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1_MASK (0xE0U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_TX_POL_INV_3_1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1_MASK (0xE00U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1_SHIFT (9U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PRX_LN_DIS_3_1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1_MASK (0xE000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1_SHIFT (13U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_CTRL2_PTX_LN_DIS_3_1_MASK)
/*! @} */

/*! @name VR_XS_PCS_DIG_ERRCNT_SEL - VR XS or PCS MMD Digital Error Count Select Register. */
/*! @{ */

