zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_COR_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN_MASK (0x10U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_INV_EC_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN_MASK (0x20U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_CHKEND_EC_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN_MASK (0x40U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN_SHIFT (6U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_DSKW_EC_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN_MASK (0x80U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN_SHIFT (7U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_ERRCNT_SEL_TP_MIS_EN_MASK)
/*! @} */

/*! @name VR_XS_PCS_XAUI_CTRL - VR XS or PCS MMD XAUI Mode Control Register This register is present only when the DWC_xpcs is configured for RXAUI. */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_XAUI_MODE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI_MASK (0x2U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_XAUI_CTRL_MRVL_RXAUI_MASK)
/*! @} */

/*! @name VR_XS_PCS_DEBUG_CTRL - VR XS or PCS MMD Debug Control Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1_MASK (0xEU)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RESTAR_SYNC_3_1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET_MASK (0x10U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_LOS_DET_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET_MASK (0x20U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SUPRESS_EEE_LOS_DET_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL_MASK (0x40U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL_SHIFT (6U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_DT_EN_CTL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL_MASK (0x80U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL_SHIFT (7U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_SYNC_CTL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL_MASK (0x100U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_TX_PMBL_CTL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL_MASK (0x200U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL_SHIFT (9U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_RX_PMBL_CTL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN_MASK (0x400U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN_SHIFT (10U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_SS_CORE_EN_MASK)

