zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL_MASK (0x2000U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL_SHIFT (13U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DEBUG_CTRL_LOS_SEL_MASK)
/*! @} */

/*! @name VR_XS_PCS_EEE_MCTRL0 - VR XS or PCS MMD EEE Mode Control Register This register enables or disables the Energy Efficient Ethernet (EEE) support. */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LTX_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN_MASK (0x2U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_LRX_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN_MASK (0x4U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN_SHIFT (2U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_QUIET_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN_MASK (0x8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN_SHIFT (3U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_QUIET_EN_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL_MASK (0x10U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_TX_EN_CTRL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP_MASK (0x20U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_EEE_SLR_BYP_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT_MASK (0x40U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT_SHIFT (6U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_SIGN_BIT_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL_MASK (0x80U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL_SHIFT (7U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_RX_EN_CTRL_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS_MASK (0xF00U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_MULT_FACT_100NS_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP_MASK (0xF000U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP_SHIFT (12U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL0_CLKSTOP_MASK)
/*! @} */

/*! @name VR_XS_PCS_EEE_TXTIMER - VR XS or PCS MMD EEE Tx Timer Register This register is present only if EEE_EN = Enabled. */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES_MASK (0x3FU)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES_WIDTH (6U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TSL_RES_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES_MASK (0xC0U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES_SHIFT (6U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES_WIDTH (2U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_T1U_RES_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES_MASK (0x1F00U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES_WIDTH (5U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_TXTIMER_TWL_RES_MASK)
/*! @} */

/*! @name VR_XS_PCS_EEE_RXTIMER - VR XS or PCS MMD EEE Rx Timer Register This register is present only if EEE_EN = Enabled. */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U_MASK (0xFFU)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U_WIDTH (8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_RES_100U_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES_MASK (0x3F00U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES_WIDTH (6U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_RXTIMER_TWR_RES_MASK)
/*! @} */

