zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PCS_MMD.h
/*! @name VR_XS_PCS_EEE_MCTRL1 - VR XS or PCS MMD EEE Mode Control 1 Register This register also controls the Energy Efficient Ethernet (EEE) related settings of DWC_xpcs . */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI_MASK (0x1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_LPI_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR_MASK (0x7EU)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR_WIDTH (6U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TXEN_EA_TMR_MASK)

#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI_MASK (0x100U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_EEE_MCTRL1_TRN_RXLPI_MASK)
/*! @} */

/*! @name VR_XS_PCS_DIG_STS - VR XS or PCS MMD Digital Status Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE_MASK (0x2U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE_SHIFT (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_LB_ACTIVE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE_MASK (0x1CU)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE_SHIFT (2U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_PSEQ_STATE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF_MASK (0x20U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF_SHIFT (5U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_UNDF_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF_MASK (0x40U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF_SHIFT (6U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_RXFIFO_OVF_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP_MASK (0x80U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP_SHIFT (7U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_SOP_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T_MASK (0x100U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_T_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR_MASK (0x200U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR_SHIFT (9U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR_WIDTH (1U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_INV_XGM_CHAR_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE_MASK (0x1C00U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE_SHIFT (10U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_LRX_STATE_MASK)

#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE_MASK (0xE000U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE_SHIFT (13U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE_WIDTH (3U)
#define XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_DIG_STS_LTX_STATE_MASK)
/*! @} */

/*! @name VR_XS_PCS_ICG_ERRCNT1 - VR XS or PCS MMD Invalid Code Group Error Count1 Register The seven error counters EC0-EC6 do not overflow. */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0_MASK (0xFFU)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0_WIDTH (8U)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1_MASK (0xFF00U)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1_WIDTH (8U)
#define XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1(x)  (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_ICG_ERRCNT1_EC1_MASK)
/*! @} */

/*! @name VR_XS_PCS_CDT_STS - VR XS or PCS MMD Comma-Detect Status Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0_MASK  (0xFU)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH0_MASK)

#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1_MASK  (0xF0U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1_SHIFT (4U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH1_MASK)

#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2_MASK  (0xF00U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2_SHIFT (8U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH2_MASK)

#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3_MASK  (0xF000U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3_SHIFT (12U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3_WIDTH (4U)
#define XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_CDT_STS_CMSH3_MASK)
/*! @} */

/*! @name VR_XS_PCS_MISC_STS - VR XS or PCS MMD Miscellaneous Status Register */
/*! @{ */

#define XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH_MASK  (0x7FU)
#define XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH_SHIFT (0U)
#define XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH_WIDTH (7U)
#define XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH(x)    (((uint16_t)(((uint16_t)(x)) << XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH_SHIFT)) & XS_PCS_MMD_VR_XS_PCS_MISC_STS_BKSH_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group XS_PCS_MMD_Register_Masks */

/*!
 * @}
 */ /* end of group XS_PCS_MMD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_XS_PCS_MMD_H_) */
